# BGE Reranker Extension for Dify

Расширение для Dify, предоставляющее возможность использования BGE Reranker v2 m3 для ранжирования документов по релевантности к поисковым запросам.

## Описание

Это расширение интегрирует мощный сервис ранжирования документов BGE Reranker v2 m3 в платформу Dify. Оно позволяет улучшить результаты поиска в RAG (Retrieval-Augmented Generation) приложениях, переранжируя документы на основе их релевантности к пользовательскому запросу.

## Возможности

- ✅ **Регистрация как модель в Dify** - модель появится в списке доступных reranker моделей
- ✅ Высокопроизводительное ранжирование документов
- ✅ Использование модели BAAI/bge-reranker-v2-m3
- ✅ Поддержка GPU для ускорения обработки
- ✅ Настраиваемое количество возвращаемых результатов (top_k)
- ✅ Проверка работоспособности сервиса (health check)
- ✅ Обработка ошибок и таймаутов
- ✅ Автоматическая валидация подключения к API

## Требования

### Серверная часть (Reranker API)

Перед использованием расширения необходимо развернуть сервис BGE Reranker API. См. основную документацию проекта для инструкций по развертыванию.

**Минимальные требования:**
- Python 3.11+
- PyTorch 2.4.0+ с поддержкой CUDA (опционально, для GPU)
- Доступный HTTP/HTTPS эндпоинт

### Расширение Dify

- Dify версии, поддерживающей расширения
- Python 3.11+ (на сервере Dify)
- Библиотека `requests` (устанавливается автоматически)

## Установка

### 1. Развертывание Reranker API

Сначала разверните сервис BGE Reranker API:

```bash
# Используя Docker Compose
docker-compose up -d

# Или соберите образ вручную
docker build -t bge-reranker .
docker run -d -p 8009:8009 --gpus all bge-reranker
```

Убедитесь, что API доступен по адресу `http://your-server:8009`

### 2. Установка расширения в Dify

1. **Упакуйте расширение:**
   ```bash
   cd rerank
   zip -r bge-reranker-extension.difypkg .
   ```

2. **Загрузите через веб-интерфейс Dify:**
   - Перейдите в раздел "Extensions" или "Plugins"
   - Выберите "Install from Local Package"
   - Загрузите файл `bge-reranker-extension.difypkg`

3. **Настройте расширение:**
   - Укажите URL вашего Reranker API: `http://your-server:8009`
   - Настройте таймаут (по умолчанию 30 секунд)
   - Установите количество топ-результатов (по умолчанию 5)

## Конфигурация

### Параметры конфигурации

| Параметр | Тип | Обязательный | По умолчанию | Описание |
|----------|-----|--------------|--------------|----------|
| `api_url` | string | Да | `http://localhost:8009` | URL сервиса Reranker API |
| `timeout` | integer | Нет | 30 | Таймаут запроса в секундах (1-300) |
| `top_k` | integer | Нет | 5 | Количество топ-результатов (1-100) |
| `input_format` | string | Нет | "auto" | Формат входных данных: "passages", "documents", или "auto" |
| `output_format` | string | Нет | "standard" | Формат выходных данных: "standard" (с индексом) или "simple" (без индекса) |

### Пример конфигурации

**Базовая конфигурация:**
```json
{
  "api_url": "http://localhost:8009",
  "timeout": 30,
  "top_k": 10
}
```

**Конфигурация с настройкой форматов:**
```json
{
  "api_url": "http://localhost:8009",
  "timeout": 30,
  "top_k": 10,
  "input_format": "documents",
  "output_format": "simple"
}
```

**Подробнее о форматах:** см. `FORMAT_CONFIGURATION.md`

## Использование

### После установки расширения

После установки расширения в Dify:

1. **Модель появится в списке доступных reranker моделей**
   - Перейдите в **Settings → Model Providers** (или **Models**)
   - Найдите **"BGE Reranker"** в списке провайдеров
   - Модель будет отображаться как **"BAAI/bge-reranker-v2-m3"**

2. **Настройте подключение к API:**
   - Выберите модель **"BGE Reranker"**
   - Укажите **API URL** вашего сервиса (например: `http://localhost:8009`)
   - Настройте **Timeout** и **Top K** при необходимости
   - Сохраните настройки

3. **Используйте в Knowledge Base:**
   - При создании или редактировании Knowledge Base
   - В настройках выберите **Reranker Model**
   - Выберите **"BAAI/bge-reranker-v2-m3"** из списка
   - Модель будет автоматически использоваться для улучшения результатов поиска

### В Dify Workflow

1. Добавьте узел "Reranker" в ваш workflow
2. Выберите модель **"BAAI/bge-reranker-v2-m3"** из списка доступных моделей
3. Подключите результаты поиска документов
4. Укажите поисковый запрос пользователя
5. Настройте количество возвращаемых результатов

### Программное использование

```python
from main import rerank

# Пример использования
query = "машинное обучение"
documents = [
    "Машинное обучение - это раздел искусственного интеллекта",
    "Python - популярный язык программирования",
    "Нейронные сети используются в глубоком обучении"
]

config = {
    "api_url": "http://localhost:8009",
    "top_k": 3
}

results = rerank(query, documents, config)

for result in results:
    print(f"Score: {result['score']:.2f} - {result['document']}")
```

## Формат данных

### Входные данные

- **query** (string): Поисковый запрос
- **documents** (list[string]): Список документов для ранжирования

### Выходные данные

Список словарей с полями:
- **document** (string): Текст документа
- **score** (float): Оценка релевантности (чем выше, тем релевантнее)
- **index** (integer): Оригинальный индекс документа

Результаты отсортированы по убыванию score.

## Проверка работоспособности

Расширение автоматически проверяет доступность сервиса при инициализации. Вы также можете проверить вручную:

```bash
curl http://your-server:8009/health
```

Ожидаемый ответ:
```json
{
  "status": "ok",
  "model": "BAAI/bge-reranker-v2-m3",
  "device": "cuda"
}
```

## Устранение неполадок

### Ошибка подключения

**Проблема:** "Failed to connect to reranker service"

**Решение:**
- Проверьте, что Reranker API запущен и доступен
- Убедитесь, что URL в конфигурации правильный
- Проверьте сетевые настройки и файрвол

### Таймаут запроса

**Проблема:** "Request timeout"

**Решение:**
- Увеличьте значение `timeout` в конфигурации
- Проверьте производительность сервера Reranker API
- Убедитесь, что GPU доступен (для ускорения)

### Пустой список документов

**Проблема:** "Documents list cannot be empty"

**Решение:**
- Убедитесь, что в workflow передаются документы
- Проверьте предыдущие узлы в workflow

## Производительность

- **Скорость:** ~100-500 документов/сек (зависит от GPU)
- **Латентность:** 50-200ms для типичного запроса
- **Максимум документов:** 1000 за один запрос
- **Максимальная длина:** 512 токенов для запроса и каждого документа

## Безопасность

- Используйте HTTPS для продакшн окружения
- Настройте аутентификацию для Reranker API (если требуется)
- Ограничьте доступ к API через файрвол
- Регулярно обновляйте зависимости

## Лицензия

См. основную лицензию проекта.

## Поддержка

При возникновении проблем:
1. Проверьте логи Dify и Reranker API
2. Убедитесь, что все сервисы запущены
3. Проверьте конфигурацию расширения
4. Обратитесь к документации проекта

## Версия

**Текущая версия:** 1.0.0

**Совместимость:**
- Dify: последние версии с поддержкой расширений
- Reranker API: 1.0+

